tap "nikitabobko/tap"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Modern, maintained replacement for ls
brew "eza"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Simple terminal UI for git commands
brew "lazygit"
# Mac App Store command-line interface
brew "mas"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Web browser focusing on privacy
cask "brave-browser"
# Modern terminal emulator
cask "alacritty"
# Team communication and collaboration software
cask "discord"
# Docker Desktop for building and sharing containerized applications
cask "docker"
# Note-taking and workspace application
cask "notion"
# Productivity launcher and command bar for macOS
cask "raycast"
mas "Microsoft Outlook", id: 985367838
mas "The Camelizer", id: 1532579087

# Manually installed apps inventory (non-Homebrew or not yet mapped to casks):
# - Cursor
# - DaVinci Resolve
# - LockDown Browser
